# Eleman İşlemleri

In [34]:
import numpy as np
import pandas as pd

In [35]:
s1=np.random.randint(10,size=5)
s2=np.random.randint(10,size=5)
s3=np.random.randint(10,size=5)

In [47]:
sozluk={"a":s1 , "b":s2 , "c":s3}

In [37]:
sozluk #sağ tarafdakiler key

{'var1': array([2, 3, 6, 7, 4]),
 'var2': array([4, 8, 1, 4, 7]),
 'var3': array([8, 0, 0, 4, 6])}

In [48]:
df=pd.DataFrame(sozluk)
df

   a  b  c
0  2  4  8
1  3  8  0
2  6  1  0
3  7  4  4
4  4  7  6

In [39]:
df[0:1]

   var1  var2  var3
0     2     4     8

In [40]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [49]:
df.index=["a" , "b" , "c" , "d" , "e"]

In [50]:
df

   a  b  c
a  2  4  8
b  3  8  0
c  6  1  0
d  7  4  4
e  4  7  6

In [45]:
df["c" : "e"]

   var1  var2  var3
c     6     1     0
d     7     4     4
e     4     7     6

In [54]:
#silme
df.drop("a" , axis=0) #satırı kastetmek için "0" kullanılır

   a  b  c
b  3  8  0
c  6  1  0
d  7  4  4
e  4  7  6

In [55]:
df

   a  b  c
a  2  4  8
b  3  8  0
c  6  1  0
d  7  4  4
e  4  7  6

In [56]:
df.drop("a" , axis=0 , inplace=True) #inplace kalıcı olarak değişiklik için kullanılır

In [57]:
df

   a  b  c
b  3  8  0
c  6  1  0
d  7  4  4
e  4  7  6

In [58]:
#fancy ile birden fazla satır ya da sütun silmek

l=["c" , "e"]
df.drop(l, axis=0)

__değişkenler__

In [66]:
k=["a" , "c"]
df.drop(k, axis=1 , inplace=True) # a ve c sütununu silme

In [62]:
"var1" in df

False

In [67]:
df

   b
b  8
c  1
d  4
e  7

In [68]:
"a" in df

False

In [69]:
"b" in df

True

In [70]:
"e" in df #değişken değil index olduğu için yok

False

In [72]:
h=["a" , "b" , "e"]
for i in h:
    print(i in df)  
# döngü kurarak h içerisindeki değişkenlerin olup olmadığının kontrolü

False
True
False

In [75]:
df["b"]

b    8
c    1
d    4
e    7
Name: b, dtype: int32

In [76]:
df

   b
b  8
c  1
d  4
e  7

In [82]:
df["e"]=[1,5,9,8]

In [86]:
df["f"]= df["b"] * df["e"] +3

In [87]:
df

   b  e   f
b  8  1  11
c  1  5   8
d  4  9  39
e  7  8  59

__değişken silmek__

In [90]:
df.drop("e" , axis=1) #satırdaki e'yi değil sütundakini silmesini istediğim için axis=1 dedim

   b   f
b  8  11
c  1   8
d  4  39
e  7  59

In [91]:
df

   b  e   f
b  8  1  11
c  1  5   8
d  4  9  39
e  7  8  59

In [92]:
df.drop("e" , axis=1 , inplace=True)

In [93]:
df

   b   f
b  8  11
c  1   8
d  4  39
e  7  59